Range is the difference between the maximum and minimum values in the dataset .it provides a measure of the spread of data , but it can be sensitive to outliers .
Range=Maximum-Minimum

In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

In [3]:
dataset= pd.read_csv("Titanic-Dataset.csv")
dataset.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

lets find what is the range of age of people died

In [6]:
min_r=dataset["Age"].min()

4 months old baby - minimum

In [7]:
max_r=dataset["Age"].max()

In [10]:
min_r,max_r

(np.float64(0.42), np.float64(80.0))

In [9]:
range = max_r - min_r
range

np.float64(79.58)